Revit 2026 API

# ParameterSet(String) Method

---

Sets the parameter to a new string of text.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Set(
	string value
)
```
```vb
Public Function Set (
	value As String
) As Boolean
```
```cpp
public:
bool Set(
	String^ value
)
```
```fsharp
member Set :
        value : string -> bool
```

#### Parameters

value String
    The new text value to which the parameter is to be set.

#### Return Value

BooleanThe Set method will return True if the parameter was successfully set to the new value, otherwise false.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The parameter is read-only. |

You should only use this method if the StorageType property reports the type of the parameter as a String.

#### Reference

Parameter Class

Set Overload

Autodesk.Revit.DB Namespace